0/CH4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 0 0 0 0 0 0 0 ];

internalField       uniform 0.0349;

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform 0.0349;
    }

    outlet          
    {
        type            zeroGradient;
    }

    upperWall       
    {
        type            zeroGradient;
    }

    lowerWall       
    {
        type            zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
