0/N2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           volScalarField;
    object          p;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions          [ 0 0 0 0 0 0 0 ];

internalField   uniform 0.76239;

boundaryField
{
    inlet           
    {
        type            fixedValue;
	value uniform 0.76244;
    }


    outlet          
    {
        type            zeroGradient;
    }

    upperWall       
    {
        type            zeroGradient;
    }

    lowerWall       
    {
        type            zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
