0/Ydefault
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ydefault;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [ 0 0 0 0 0 0 0 ];

internalField           uniform 0;

boundaryField
{
    inlet           
    {
        type            fixedValue;
	    value           uniform 0;
    }

    outlet          
    {
        type            zeroGradient;
    }

    upperWall       
    {
        type            zeroGradient;
    }

    lowerWall       
    {
        type            zeroGradient;
    }

    frontAndBack    
    {
        type            empty;
    }
}


// ************************************************************************* //
